# ASSIGNMENT 3 
**Topic: Chapter 5 & Chapter 6**
- Due: 9th June 2024
- Mode: Individual Assignment
- Submission: E-Learning

### Solehah Najiihah Binti Abd Jamal
### MCS231035

### QUESTION 1


(a)	Read the ``Diabetes Dataset.csv`` and save the data into a DataFrame.

In [1]:
# WRITE YOUR CODE HERE

import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv("Diabetes Dataset.csv")
df

,No_Times_Pregnant,Plasma_Glucose,Diastolic,Triceps,Insulin,BMI,Diabetes_Pedigree,Age
0,6.0,148.0,72.0,35.0,NaN,33.6,0.627,50
1,1.0,85.0,66.0,29.0,NaN,26.6,0.351,31
2,8.0,183.0,64.0,NaN,NaN,23.3,0.672,32
3,1.0,89.0,66.0,23.0,94.0,28.1,0.167,21
4,NaN,137.0,40.0,35.0,168.0,43.1,2.288,33
...,...,...,...,...,...,...,...,...
763,10.0,101.0,76.0,48.0,180.0,32.9,0.171,63
764,2.0,122.0,70.0,27.0,NaN,36.8,0.340,27
765,5.0,121.0,72.0,23.0,112.0,26.2,0.245,30
766,1.0,126.0,60.0,NaN,NaN,30.1,0.349,47
767,1.0,93.0,70.0,31.0,NaN,30.4,0.315,23

(b)	What is the shape of the DataFrame?

In [3]:
# WRITE YOUR CODE HERE

df.shape

(768, 8)

(c)	Get the number of missing values for each column.

In [4]:
# WRITE YOUR CODE HERE

df.isnull().sum()

No_Times_Pregnant    111
Plasma_Glucose         7
Diastolic             36
Triceps              228
Insulin              375
BMI                   14
Diabetes_Pedigree      1
Age                    0
dtype: int64

(d)	Fill in all the missing values in column No_Times_Pregnant with value 1.

In [5]:
# WRITE YOUR CODE HERE

df['No_Times_Pregnant'].fillna(1, inplace=True)
df

,No_Times_Pregnant,Plasma_Glucose,Diastolic,Triceps,Insulin,BMI,Diabetes_Pedigree,Age
0,6.0,148.0,72.0,35.0,NaN,33.6,0.627,50
1,1.0,85.0,66.0,29.0,NaN,26.6,0.351,31
2,8.0,183.0,64.0,NaN,NaN,23.3,0.672,32
3,1.0,89.0,66.0,23.0,94.0,28.1,0.167,21
4,1.0,137.0,40.0,35.0,168.0,43.1,2.288,33
...,...,...,...,...,...,...,...,...
763,10.0,101.0,76.0,48.0,180.0,32.9,0.171,63
764,2.0,122.0,70.0,27.0,NaN,36.8,0.340,27
765,5.0,121.0,72.0,23.0,112.0,26.2,0.245,30
766,1.0,126.0,60.0,NaN,NaN,30.1,0.349,47
767,1.0,93.0,70.0,31.0,NaN,30.4,0.315,23

(e)	Drop all rows which contains less than 4 observation values.

In [6]:
# WRITE YOUR CODE HERE

df.dropna(thresh=4, inplace=True)
df                                  # 3 rows dropped

,No_Times_Pregnant,Plasma_Glucose,Diastolic,Triceps,Insulin,BMI,Diabetes_Pedigree,Age
0,6.0,148.0,72.0,35.0,NaN,33.6,0.627,50
1,1.0,85.0,66.0,29.0,NaN,26.6,0.351,31
2,8.0,183.0,64.0,NaN,NaN,23.3,0.672,32
3,1.0,89.0,66.0,23.0,94.0,28.1,0.167,21
4,1.0,137.0,40.0,35.0,168.0,43.1,2.288,33
...,...,...,...,...,...,...,...,...
763,10.0,101.0,76.0,48.0,180.0,32.9,0.171,63
764,2.0,122.0,70.0,27.0,NaN,36.8,0.340,27
765,5.0,121.0,72.0,23.0,112.0,26.2,0.245,30
766,1.0,126.0,60.0,NaN,NaN,30.1,0.349,47
767,1.0,93.0,70.0,31.0,NaN,30.4,0.315,23

(f)	Fill in all the missing values in below columns with the given values or methods:

<br>
<img src="Figure 1.png", style="width: 350px";>

In [7]:
df.columns

Index(['No_Times_Pregnant', 'Plasma_Glucose', 'Diastolic', 'Triceps',
       'Insulin', 'BMI', 'Diabetes_Pedigree', 'Age'],
      dtype='object')

In [8]:
# WRITE YOUR CODE HERE

df['Plasma_Glucose'].fillna(df['Plasma_Glucose'].mean(), inplace=True)
df['Diastolic'].ffill(inplace=True)
df['Triceps'].bfill(inplace=True)
df['Insulin'].fillna(df['Insulin'].mean(), inplace=True)
df['BMI'].fillna(df['BMI'].median(), inplace=True)
df

,No_Times_Pregnant,Plasma_Glucose,Diastolic,Triceps,Insulin,BMI,Diabetes_Pedigree,Age
0,6.0,148.0,72.0,35.0,155.715013,33.6,0.627,50
1,1.0,85.0,66.0,29.0,155.715013,26.6,0.351,31
2,8.0,183.0,64.0,23.0,155.715013,23.3,0.672,32
3,1.0,89.0,66.0,23.0,94.000000,28.1,0.167,21
4,1.0,137.0,40.0,35.0,168.000000,43.1,2.288,33
...,...,...,...,...,...,...,...,...
763,10.0,101.0,76.0,48.0,180.000000,32.9,0.171,63
764,2.0,122.0,70.0,27.0,155.715013,36.8,0.340,27
765,5.0,121.0,72.0,23.0,112.000000,26.2,0.245,30
766,1.0,126.0,60.0,31.0,155.715013,30.1,0.349,47
767,1.0,93.0,70.0,31.0,155.715013,30.4,0.315,23

(g)	Check back the number of missing values for each column. It should now be 0 for all the columns.

In [9]:
# WRITE YOUR CODE HERE

df.isnull().sum()

No_Times_Pregnant    0
Plasma_Glucose       0
Diastolic            0
Triceps              0
Insulin              0
BMI                  0
Diabetes_Pedigree    0
Age                  0
dtype: int64

In [10]:
df.head()

,No_Times_Pregnant,Plasma_Glucose,Diastolic,Triceps,Insulin,BMI,Diabetes_Pedigree,Age
0,6.0,148.0,72.0,35.0,155.715013,33.6,0.627,50
1,1.0,85.0,66.0,29.0,155.715013,26.6,0.351,31
2,8.0,183.0,64.0,23.0,155.715013,23.3,0.672,32
3,1.0,89.0,66.0,23.0,94.000000,28.1,0.167,21
4,1.0,137.0,40.0,35.0,168.000000,43.1,2.288,33

(h)	Bin the age into below categories. How many patients with diabetes for each category? 

<br>
<img src="Figure 2.png", style="width: 150px";>

In [11]:
# WRITE YOUR CODE HERE

bins = [20,30,40,50,60,70,80,90]
df['Age Groups'] = pd.cut(df['Age'], bins, right=False)
df

,No_Times_Pregnant,Plasma_Glucose,Diastolic,Triceps,Insulin,BMI,Diabetes_Pedigree,Age,Age Groups
0,6.0,148.0,72.0,35.0,155.715013,33.6,0.627,50,"[50, 60)"
1,1.0,85.0,66.0,29.0,155.715013,26.6,0.351,31,"[30, 40)"
2,8.0,183.0,64.0,23.0,155.715013,23.3,0.672,32,"[30, 40)"
3,1.0,89.0,66.0,23.0,94.000000,28.1,0.167,21,"[20, 30)"
4,1.0,137.0,40.0,35.0,168.000000,43.1,2.288,33,"[30, 40)"
...,...,...,...,...,...,...,...,...,...
763,10.0,101.0,76.0,48.0,180.000000,32.9,0.171,63,"[60, 70)"
764,2.0,122.0,70.0,27.0,155.715013,36.8,0.340,27,"[20, 30)"
765,5.0,121.0,72.0,23.0,112.000000,26.2,0.245,30,"[30, 40)"
766,1.0,126.0,60.0,31.0,155.715013,30.1,0.349,47,"[40, 50)"
767,1.0,93.0,70.0,31.0,155.715013,30.4,0.315,23,"[20, 30)"

In [12]:
# total patients in each age group

agegroup = pd.cut(df['Age'], bins, right=False)
pd.value_counts(agegroup)

C:\Users\pc\AppData\Local\Temp\ipykernel_3712\3939483150.py:4: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(agegroup)

Age
[20, 30)    395
[30, 40)    163
[40, 50)    118
[50, 60)     57
[60, 70)     29
[70, 80)      2
[80, 90)      1
Name: count, dtype: int64

### QUESTION 2

(a)	Read the ``Live births by state and sex.xlsx`` and save the data into a DataFrame.

In [13]:
# WRITE YOUR CODE HERE

df2 = pd.read_excel('Live births by state and sex.xlsx')
df2

     Year              State     Sex  Number of Live births
0    2018              Johor  Female                  29428
1    2018              Johor    Male                  31656
2    2018              Kedah  Female                  17181
3    2018              Kedah    Male                  18462
4    2018           Kelantan  Female                  18376
..    ...                ...     ...                    ...
313  2009         Terengganu    Male                  12152
314  2009  W.P. Kuala Lumpur  Female                  12612
315  2009  W.P. Kuala Lumpur    Male                  13252
316  2009        W.P. Labuan  Female                    804
317  2009        W.P. Labuan    Male                    845

[318 rows x 4 columns]

(b)	Read another file named ``Death by state and sex.xlsx`` and save it into another DataFrame.

In [14]:
# WRITE YOUR CODE HERE

df3 = pd.read_excel('Death by state and sex.xlsx')
df3

     Year              State     Sex  Number of death
0    2018              Johor  Female             8733
1    2018              Johor    Male            12384
2    2018              Kedah  Female             6336
3    2018              Kedah    Male             8216
4    2018           Kelantan  Female             4984
..    ...                ...     ...              ...
313  2009         Terengganu    Male             3491
314  2009  W.P. Kuala Lumpur  Female             2662
315  2009  W.P. Kuala Lumpur    Male             3808
316  2009        W.P. Labuan  Female               94
317  2009        W.P. Labuan    Male              153

[318 rows x 4 columns]

(c)	Merge both files.

In [15]:
# WRITE YOUR CODE HERE

# merged dataframe
dfm = df2.merge(df3)
dfm

     Year              State     Sex  Number of Live births  Number of death
0    2018              Johor  Female                  29428             8733
1    2018              Johor    Male                  31656            12384
2    2018              Kedah  Female                  17181             6336
3    2018              Kedah    Male                  18462             8216
4    2018           Kelantan  Female                  18376             4984
..    ...                ...     ...                    ...              ...
299  2009         Terengganu    Male                  12152             3491
300  2009  W.P. Kuala Lumpur  Female                  12612             2662
301  2009  W.P. Kuala Lumpur    Male                  13252             3808
302  2009        W.P. Labuan  Female                    804               94
303  2009        W.P. Labuan    Male                    845              153

[304 rows x 5 columns]

In [16]:
pd.merge?

Signature:
pd.merge(
    left: 'DataFrame | Series',
    right: 'DataFrame | Series',
    how: 'MergeHow' = 'inner',
    on: 'IndexLabel | None' = None,
    left_on: 'IndexLabel | None' = None,
    right_on: 'IndexLabel | None' = None,
    left_index: 'bool' = False,
    right_index: 'bool' = False,
    sort: 'bool' = False,
    suffixes: 'Suffixes' = ('_x', '_y'),
    copy: 'bool | None' = None,
    indicator: 'str | bool' = False,
    validate: 'str | None' = None,
) -> 'DataFrame'
Docstring:
Merge DataFrame or named Series objects with a database-style join.

A named Series object is treated as a DataFrame with a single named column.

The join is done on columns or indexes. If joining columns on
columns, the DataFrame indexes *will be ignored*. Otherwise if joining indexes
on indexes or indexes on a column or columns, the index will be passed on.
When performing a cross merge, no column specifications to merge on are
allowed.

.. warning::

    If both key columns contain rows where the key is a null value, those
    rows will be matched against each other. This is different from usual SQL
    join behaviour and can lead to unexpected results.

Parameters
----------
left : DataFrame or named Series
right : DataFrame or named Series
    Object to merge with.
how : {'left', 'right', 'outer', 'inner', 'cross'}, default 'inner'
    Type of merge to be performed.

    * left: use only keys from left frame, similar to a SQL left outer join;
      preserve key order.
    * right: use only keys from right frame, similar to a SQL right outer join;
      preserve key order.
    * outer: use union of keys from both frames, similar to a SQL full outer
      join; sort keys lexicographically.
    * inner: use intersection of keys from both frames, similar to a SQL inner
      join; preserve the order of the left keys.
    * cross: creates the cartesian product from both frames, preserves the order
      of the left keys.

      .. versionadded:: 1.2.0

on : label or list
    Column or index level names to join on. These must be found in both
    DataFrames. If `on` is None and not merging on indexes then this defaults
    to the intersection of the columns in both DataFrames.
left_on : label or list, or array-like
    Column or index level names to join on in the left DataFrame. Can also
    be an array or list of arrays of the length of the left DataFrame.
    These arrays are treated as if they are columns.
right_on : label or list, or array-like
    Column or index level names to join on in the right DataFrame. Can also
    be an array or list of arrays of the length of the right DataFrame.
    These arrays are treated as if they are columns.
left_index : bool, default False
    Use the index from the left DataFrame as the join key(s). If it is a
    MultiIndex, the number of keys in the other DataFrame (either the index
    or a number of columns) must match the number of levels.
right_index : bool, default False
    Use the index from the right DataFrame as the join key. Same caveats as
    left_index.
sort : bool, default False
    Sort the join keys lexicographically in the result DataFrame. If False,
    the order of the join keys depends on the join type (how keyword).
suffixes : list-like, default is ("_x", "_y")
    A length-2 sequence where each element is optionally a string
    indicating the suffix to add to overlapping column names in
    `left` and `right` respectively. Pass a value of `None` instead
    of a string to indicate that the column name from `left` or
    `right` should be left as-is, with no suffix. At least one of the
    values must not be None.
copy : bool, default True
    If False, avoid copy if possible.
indicator : bool or str, default False
    If True, adds a column to the output DataFrame called "_merge" with
    information on the source of each row. The column can be given a different
    name by providing a string argument. The column will have a Categorical
    type with the value of "left_only" for observations whose merge key only
    appears in the left DataFrame, "right_only" for observations
    whose merge key only appears in the right DataFrame, and "both"
    if the observation's merge key is found in both DataFrames.

validate : str, optional
    If specified, checks if merge is of specified type.

    * "one_to_one" or "1:1": check if merge keys are unique in both
      left and right datasets.
    * "one_to_many" or "1:m": check if merge keys are unique in left
      dataset.
    * "many_to_one" or "m:1": check if merge keys are unique in right
      dataset.
    * "many_to_many" or "m:m": allowed, but does not result in checks.

Returns
-------
DataFrame
    A DataFrame of the two merged objects.

See Also
--------
merge_ordered : Merge with optional filling/interpolation.
merge_asof : Merge on nearest keys.
DataFrame.join : Similar method using indices.

Examples
--------
>>> df1 = pd.DataFrame({'lkey': ['foo', 'bar', 'baz', 'foo'],
...                     'value': [1, 2, 3, 5]})
>>> df2 = pd.DataFrame({'rkey': ['foo', 'bar', 'baz', 'foo'],
...                     'value': [5, 6, 7, 8]})
>>> df1
    lkey value
0   foo      1
1   bar      2
2   baz      3
3   foo      5
>>> df2
    rkey value
0   foo      5
1   bar      6
2   baz      7
3   foo      8

Merge df1 and df2 on the lkey and rkey columns. The value columns have
the default suffixes, _x and _y, appended.

>>> df1.merge(df2, left_on='lkey', right_on='rkey')
  lkey  value_x rkey  value_y
0  foo        1  foo        5
1  foo        1  foo        8
2  foo        5  foo        5
3  foo        5  foo        8
4  bar        2  bar        6
5  baz        3  baz        7

Merge DataFrames df1 and df2 with specified left and right suffixes
appended to any overlapping columns.

>>> df1.merge(df2, left_on='lkey', right_on='rkey',
...           suffixes=('_left', '_right'))
  lkey  value_left rkey  value_right
0  foo           1  foo            5
1  foo           1  foo            8
2  foo           5  foo            5
3  foo           5  foo            8
4  bar           2  bar            6
5  baz           3  baz            7

Merge DataFrames df1 and df2, but raise an exception if the DataFrames have
any overlapping columns.

>>> df1.merge(df2, left_on='lkey', right_on='rkey', suffixes=(False, False))
Traceback (most recent call last):
...
ValueError: columns overlap but no suffix specified:
    Index(['value'], dtype='object')

>>> df1 = pd.DataFrame({'a': ['foo', 'bar'], 'b': [1, 2]})
>>> df2 = pd.DataFrame({'a': ['foo', 'baz'], 'c': [3, 4]})
>>> df1
      a  b
0   foo  1
1   bar  2
>>> df2
      a  c
0   foo  3
1   baz  4

>>> df1.merge(df2, how='inner', on='a')
      a  b  c
0   foo  1  3

>>> df1.merge(df2, how='left', on='a')
      a  b  c
0   foo  1  3.0
1   bar  2  NaN

>>> df1 = pd.DataFrame({'left': ['foo', 'bar']})
>>> df2 = pd.DataFrame({'right': [7, 8]})
>>> df1
    left
0   foo
1   bar
>>> df2
    right
0   7
1   8

>>> df1.merge(df2, how='cross')
   left  right
0   foo      7
1   foo      8
2   bar      7
3   bar      8
File:      c:\users\pc\anaconda3\lib\site-packages\pandas\core\reshape\merge.py
Type:      function

(d)	Set the index as figure below.

<br>
<img src="Figure 3.png", style="width: 450px";>

In [17]:
# WRITE YOUR CODE HERE

dfm.set_index(['Year', 'State'], inplace=True)

In [18]:
# checking
dfm

                           Sex  Number of Live births  Number of death
Year State
2018 Johor              Female                  29428             8733
     Johor                Male                  31656            12384
     Kedah              Female                  17181             6336
     Kedah                Male                  18462             8216
     Kelantan           Female                  18376             4984
...                        ...                    ...              ...
2009 Terengganu           Male                  12152             3491
     W.P. Kuala Lumpur  Female                  12612             2662
     W.P. Kuala Lumpur    Male                  13252             3808
     W.P. Labuan        Female                    804               94
     W.P. Labuan          Male                    845              153

[304 rows x 3 columns]

(e)	Display the number of live births and number of deaths for all the years (2009-2018) as below.

<br>
<img src="Figure 4.png", style="width: 300px";>

In [19]:
# WRITE YOUR CODE HERE

dfm.drop('Sex', axis=1).groupby(['Year'], sort=False).sum()

      Number of Live births  Number of death
Year
2018                 501945           172031
2017                 276496            94694
2016                 508203           162201
2015                 521136           155786
2014                 528612           150318
2013                 476897           133949
2012                 499015           130626
2011                 511594           127368
2010                 437605           123356
2009                 496313           123763

(f)	Swap the level as figure below.

<br>
<img src="Figure 5.png", style="width: 450px";>

In [20]:
# WRITE YOUR CODE HERE

dfm.swaplevel('Year', 'State').sort_index(level=0)

                        Sex  Number of Live births  Number of death
State          Year
Johor          2009  Female                  27386             6587
               2009    Male                  29631             9384
               2011  Female                  28205             6875
               2011    Male                  29962             9604
               2012  Female                  29230             7212
...                     ...                    ...              ...
W.P. Putrajaya 2016    Male                   1342               86
               2017  Female                   1219              106
               2017    Male                   1298              123
               2018  Female                   1149               98
               2018    Male                   1251              120

[304 rows x 3 columns]

(g)	Display the number of live births and number of deaths for all states as below.

<br>
<img src="Figure 6.png", style="width: 300px";>

In [21]:
# WRITE YOUR CODE HERE

dfm.drop('Year').drop('Sex', axis=1).groupby(['State']).sum()

                   Number of Live births  Number of death
State
Johor                             474661           145145
Kedah                             323149           114959
Kelantan                          377024           104573
Melaka                            140550            48684
Negeri Sembilan                   178570            63879
Pahang                            244748            73795
Perak                             360604           168525
Perlis                             42714            17664
Pulau Pinang                      220445            98109
Sabah                             439363            51473
Sarawak                           404715           118670
Selangor                         1042680           225139
Terengganu                        234401            57769
W.P. Kuala Lumpur                 231038            65858
W.P. Labuan                        15797             2279
W.P. Putrajaya                     27357            17571

### QUESTION 3
Given a dataset ``Tallest Building.csv`` that contains the list of the world's tallest buildings.


(a)	Read the dataset and save into a data frame named ``tallest``. Display the first 8 rows of the data frame.

In [22]:
# WRITE YOUR CODE HERE

tallest = pd.read_csv('Tallest Building.csv')
tallest.head(8)

,Category,Structure,Country,City,Height (meters),Height (feet),Year built
0,Building[5],Burj Khalifa,United Arab Emirates,Dubai,NaN,2722.0,2010
1,Compliant tower,Petronius,United States,Gulf of Mexico,640.0,2100.0,2000
2,Self-supporting tower[6],Tokyo Skytree,Japan,Tokyo,634.0,2080.0,2011
3,Guyed steel lattice mast,KVLY-TV mast,United States,"Blanchard, North Dakota",629.0,2063.0,1963
4,Hyperboloid structure,Canton Tower,China,Guangzhou,604.0,1982.0,2010
5,Clock tower,Abraj Al Bait,Saudi Arabia,Mecca,601.0,1972.0,2012
6,Fixed steel structure,Bullwinkle,United States,NaN,NaN,NaN,NaN
7,Moveable object,Troll A platform,Norway,North Sea,472.0,1549.0,1996

(b)	Find the number of rows and columns in tallest.

In [23]:
# WRITE YOUR CODE HERE

rows = tallest.shape[0]
cols = tallest.shape[1]
print(f'Number of rows: {rows}')
print(f'Number of columns: {cols}')

Number of rows: 56
Number of columns: 7

(c)	Find which columns have missing values and how many of them?

In [24]:
# WRITE YOUR CODE HERE

# tallest.isnull().sum()>0    # Finding which columns with missing values
tallest.isnull().sum()      # How many missing values in the columns

Category           1
Structure          0
Country            2
City               7
Height (meters)    8
Height (feet)      2
Year built         3
dtype: int64

In [25]:
tallest.tail(15)

,Category,Structure,Country,City,Height (meters),Height (feet),Year built
41,Air traffic control tower,Kuala Lumpur International Airport 2 Control T...,Malaysia,Sepang,141.30,463.6,2013[13]
42,Roller coaster,Kingda Ka,United States,"Jackson, New Jersey",138.98,456.0,2005
43,Tomb,Great Pyramid of Giza,Egypt,Giza,138.80,455.2,2560 BCE
44,Drop tower,Zumanjaro: Drop of Doom,United States,"Jackson Township, NJ",139.00,456.0,2014
45,Gantry crane,Kockums Crane,South Korea,Ulsan,NaN,453.0,1974
46,Stupa,Jetavanaramaya,Sri Lanka,Anuradhapura,122.00,400.0,273–301 CE
47,Wooden structure,Gliwice Radio Tower,Poland,Gliwice,118.00,387.0,1935
48,Storage silo,Swissmill Tower,Switzerland,Zurich,118.00,387.0,2016
49,Tomb,Great Pyramid of Giza,Egypt,Giza,138.80,455.2,2560 BCE
50,Gasometer,Gasometer Oberhausen,Germany,Oberhausen,117.50,386.0,1929
51,Clock tower,Joseph Chamberlain Memorial Clock Tower,United Kingdom,Birmingham,NaN,328.0,1908
52,Sphere,Avicii Arena,Sweden,Stockholm,85.00,279.0,1989
53,Gopuram,Murudeshwara Temple,India,Murudeshwara,76.00,249.0,2008
54,Tomb,Great Pyramid of Giza,Egypt,Giza,138.80,455.2,2560 BCE
55,Gasometer,Gasometer Oberhausen,Germany,Oberhausen,117.50,386.0,1929

(d)	Is there any duplicated data? **Permanently** remove the duplicate data if any.

In [26]:
# WRITE YOUR CODE HERE

# checking all duplicate rows
tallest[tallest.duplicated(keep=False)]

,Category,Structure,Country,City,Height (meters),Height (feet),Year built
29,Aerial tramway support tower,Tower 2 of Ha Long Queen Cable Car[11],Vietnam,NaN,189.0,620.0,2016
34,Aerial tramway support tower,Tower 2 of Ha Long Queen Cable Car[11],Vietnam,NaN,189.0,620.0,2016
43,Tomb,Great Pyramid of Giza,Egypt,Giza,138.8,455.2,2560 BCE
49,Tomb,Great Pyramid of Giza,Egypt,Giza,138.8,455.2,2560 BCE
50,Gasometer,Gasometer Oberhausen,Germany,Oberhausen,117.5,386.0,1929
54,Tomb,Great Pyramid of Giza,Egypt,Giza,138.8,455.2,2560 BCE
55,Gasometer,Gasometer Oberhausen,Germany,Oberhausen,117.5,386.0,1929

In [27]:
# removing the duplicates 

tallest.drop_duplicates(inplace=True)

In [28]:
# checking if there is any duplicate left

# tallest[tallest.duplicated(keep=False)]
tallest.tail(10)

,Category,Structure,Country,City,Height (meters),Height (feet),Year built
43,Tomb,Great Pyramid of Giza,Egypt,Giza,138.8,455.2,2560 BCE
44,Drop tower,Zumanjaro: Drop of Doom,United States,"Jackson Township, NJ",139.0,456.0,2014
45,Gantry crane,Kockums Crane,South Korea,Ulsan,NaN,453.0,1974
46,Stupa,Jetavanaramaya,Sri Lanka,Anuradhapura,122.0,400.0,273–301 CE
47,Wooden structure,Gliwice Radio Tower,Poland,Gliwice,118.0,387.0,1935
48,Storage silo,Swissmill Tower,Switzerland,Zurich,118.0,387.0,2016
50,Gasometer,Gasometer Oberhausen,Germany,Oberhausen,117.5,386.0,1929
51,Clock tower,Joseph Chamberlain Memorial Clock Tower,United Kingdom,Birmingham,NaN,328.0,1908
52,Sphere,Avicii Arena,Sweden,Stockholm,85.0,279.0,1989
53,Gopuram,Murudeshwara Temple,India,Murudeshwara,76.0,249.0,2008

(e)	**Permanently** delete all rows which contains at most three-observation data.

In [29]:
# WRITE YOUR CODE HERE

tallest.dropna(thresh=4, inplace=True)

(f)	For missing data in column ``Height (meters)``:	

    (i)	Get the row index of all missing values in Height (meters) and save in a list named missing_Height
    (ii)	Fill in the missing value with conversion of feet value in Height (feet) which having the index in missing_Height. The conversion rate is 1 feet = 0.3 meters.

*Ignore any warning if given by the Python*

In [30]:
# WRITE YOUR CODE HERE (i)

missing_Height = tallest[tallest['Height (meters)'].isnull()].index
missing_Height

Index([0, 27, 31, 37, 45, 51], dtype='int64')

In [31]:
# display rows with missing values in height meter

tallest[tallest['Height (meters)'].isnull()]

,Category,Structure,Country,City,Height (meters),Height (feet),Year built
0,Building[5],Burj Khalifa,United Arab Emirates,Dubai,NaN,2722.0,2010
27,Cooling tower,Kalisindh Thermal Power Station,India,Jhalawar,NaN,663.0,2012
31,Statue,Statue of Unity,India,"Narmada district, Gujarat",NaN,597.0,2018
37,Flagpole,Jeddah Flagpole,Saudi Arabia,Jeddah,NaN,561.0,2014
45,Gantry crane,Kockums Crane,South Korea,Ulsan,NaN,453.0,1974
51,Clock tower,Joseph Chamberlain Memorial Clock Tower,United Kingdom,Birmingham,NaN,328.0,1908

In [32]:
# WRITE YOUR CODE HERE (ii)

for i in missing_Height:
    tallest.loc[i, 'Height (meters)'] = tallest.loc[i, 'Height (feet)'] * 0.3

In [33]:
# checking answer
tallest.tail(10)

,Category,Structure,Country,City,Height (meters),Height (feet),Year built
43,Tomb,Great Pyramid of Giza,Egypt,Giza,138.8,455.2,2560 BCE
44,Drop tower,Zumanjaro: Drop of Doom,United States,"Jackson Township, NJ",139.0,456.0,2014
45,Gantry crane,Kockums Crane,South Korea,Ulsan,135.9,453.0,1974
46,Stupa,Jetavanaramaya,Sri Lanka,Anuradhapura,122.0,400.0,273–301 CE
47,Wooden structure,Gliwice Radio Tower,Poland,Gliwice,118.0,387.0,1935
48,Storage silo,Swissmill Tower,Switzerland,Zurich,118.0,387.0,2016
50,Gasometer,Gasometer Oberhausen,Germany,Oberhausen,117.5,386.0,1929
51,Clock tower,Joseph Chamberlain Memorial Clock Tower,United Kingdom,Birmingham,98.4,328.0,1908
52,Sphere,Avicii Arena,Sweden,Stockholm,85.0,279.0,1989
53,Gopuram,Murudeshwara Temple,India,Murudeshwara,76.0,249.0,2008

(g)	For missing data in column City:	


    (i)	Get the row index of all missing values in City and save in a list named missing_City
    (ii)	Fill in the missing value with the value in Country which having the index in missing_City

*Ignore any warning if given by the Python*

In [34]:
# WRITE YOUR CODE HERE (i)

missing_City = tallest[tallest['City'].isnull()].index
missing_City

Index([25, 26, 29], dtype='int64')

In [35]:
# displaying rows with missing values

tallest[tallest['City'].isnull()]

,Category,Structure,Country,City,Height (meters),Height (feet),Year built
25,Crane,LR 13000[8],Germany,NaN,248.0,814.0,2013
26,Jackup rig,Noble Lloyd Noble[9],Liberia,NaN,214.0,702.0,2016
29,Aerial tramway support tower,Tower 2 of Ha Long Queen Cable Car[11],Vietnam,NaN,189.0,620.0,2016

In [36]:
# WRITE YOUR CODE HERE (ii)

for j in missing_City:
    tallest.loc[j,'City'] = tallest.loc[j,'Country']

In [37]:
# checking answer

tallest.head(30)

,Category,Structure,Country,City,Height (meters),Height (feet),Year built
0,Building[5],Burj Khalifa,United Arab Emirates,Dubai,816.6,2722.0,2010
1,Compliant tower,Petronius,United States,Gulf of Mexico,640.0,2100.0,2000
2,Self-supporting tower[6],Tokyo Skytree,Japan,Tokyo,634.0,2080.0,2011
3,Guyed steel lattice mast,KVLY-TV mast,United States,"Blanchard, North Dakota",629.0,2063.0,1963
4,Hyperboloid structure,Canton Tower,China,Guangzhou,604.0,1982.0,2010
5,Clock tower,Abraj Al Bait,Saudi Arabia,Mecca,601.0,1972.0,2012
7,Moveable object,Troll A platform,Norway,North Sea,472.0,1549.0,1996
8,Mast radiator,Lualualei VLF transmitter,United States,"Lualualei, Hawaii",458.0,1503.0,1972
9,Twin building,Petronas Twin Towers,Malaysia,Kuala Lumpur,452.0,1482.0,1998
10,Steel building[7],Willis Tower,United States,"Chicago, Illinois",442.0,1450.0,1974
11,Chimney,Ekibastuz GRES-2 Power Station,Kazakhstan,Ekibastuz,419.7,1377.0,1987
13,Lattice tower,Kyiv TV Tower,Ukraine,Kyiv,385.0,1263.0,1973
14,Electricity pylon,Jintang-Cezi Overhead Powerline Link,China,Jintang Island,380.0,1247.0,2019
15,Fixed steel structure,Bullwinkle,United States,Gulf of Mexico,529.0,1736.0,1988
16,Partially guyed tower,Gerbrandy Tower,Netherlands,IJsselstein,366.8,1203.0,1961
17,Guyed tubular steel mast,TV Tower Vinnytsia,Ukraine,Vinnytsia,354.0,1161.0,1961
18,Bridge,Millau Viaduct,France,Millau,342.0,1122.0,2004
20,Dam,Jinping-I Dam,China,Liangshan,305.0,1001.0,2013
21,Landmark Tower design,Star Tower,United States,Cincinnati,291.0,954.0,1991
22,Elevator test tower,H1 Tower,China,Guangzhou,273.8,898.0,2020
23,Wind turbine,Haliade-X Prototype,Netherlands,Rotterdam,270.0,886.0,2019
24,Solar power tower,Mohammed bin Rashid Al Maktoum Solar Park,United Arab Emirates,Saih Al-Dahal,262.0,860.0,2020
25,Crane,LR 13000[8],Germany,Germany,248.0,814.0,2013
26,Jackup rig,Noble Lloyd Noble[9],Liberia,Liberia,214.0,702.0,2016
27,Cooling tower,Kalisindh Thermal Power Station,India,Jhalawar,198.9,663.0,2012
28,Monument,Gateway Arch,United States,"St. Louis, Missouri",192.0,630.0,1965
29,Aerial tramway support tower,Tower 2 of Ha Long Queen Cable Car[11],Vietnam,Vietnam,189.0,620.0,2016
30,Water tower,Main tower of Kuwait Towers,Kuwait,Kuwait City,187.0,614.0,1979
31,Statue,Statue of Unity,India,"Narmada district, Gujarat",179.1,597.0,2018
32,Masonry tower,Anaconda Smelter Stack,United States,"Anaconda, Montana",178.3,585.0,1919

(h)	Show that there are no missing values in tallest.

In [38]:
# WRITE YOUR CODE HERE

tallest.isnull().sum()

Category           0
Structure          0
Country            0
City               0
Height (meters)    0
Height (feet)      0
Year built         0
dtype: int64

(i)	Create a function named ``eliminate_ref``. This function will receive an array and perform these tasks:		

    (i)  Find whether there is any reference attached to any string in the array given. Commonly, any references can be detected by a square bracket containing a number like [5] as shown in figure below.
    
<br>
<img src="Figure 7.png", style="width: 400px";>

    (ii) If there is any reference attached, replace the word with the original word but without the reference. Set inplace=True when performing the replace method.

Test your function using the codes given below.

In [41]:
# WRITE YOUR CODE HERE (i)

import re

def eliminate_ref(arr):
    pattern = '\[\d+\]'
    for i in arr:
        if re.search('\[\d+\]', i): 
            print(i)
    arr.replace(pattern, '', inplace=True, regex=True)

In [42]:
# TEST YOUR CODE HERE

eliminate_ref(tallest['Category'])
#eliminate_ref(tallest['Structure'])
tallest

Building[5]
Self-supporting tower[6]
Steel building[7]

,Category,Structure,Country,City,Height (meters),Height (feet),Year built
0,Building,Burj Khalifa,United Arab Emirates,Dubai,816.60,2722.0,2010
1,Compliant tower,Petronius,United States,Gulf of Mexico,640.00,2100.0,2000
2,Self-supporting tower,Tokyo Skytree,Japan,Tokyo,634.00,2080.0,2011
3,Guyed steel lattice mast,KVLY-TV mast,United States,"Blanchard, North Dakota",629.00,2063.0,1963
4,Hyperboloid structure,Canton Tower,China,Guangzhou,604.00,1982.0,2010
5,Clock tower,Abraj Al Bait,Saudi Arabia,Mecca,601.00,1972.0,2012
7,Moveable object,Troll A platform,Norway,North Sea,472.00,1549.0,1996
8,Mast radiator,Lualualei VLF transmitter,United States,"Lualualei, Hawaii",458.00,1503.0,1972
9,Twin building,Petronas Twin Towers,Malaysia,Kuala Lumpur,452.00,1482.0,1998
10,Steel building,Willis Tower,United States,"Chicago, Illinois",442.00,1450.0,1974
11,Chimney,Ekibastuz GRES-2 Power Station,Kazakhstan,Ekibastuz,419.70,1377.0,1987
13,Lattice tower,Kyiv TV Tower,Ukraine,Kyiv,385.00,1263.0,1973
14,Electricity pylon,Jintang-Cezi Overhead Powerline Link,China,Jintang Island,380.00,1247.0,2019
15,Fixed steel structure,Bullwinkle,United States,Gulf of Mexico,529.00,1736.0,1988
16,Partially guyed tower,Gerbrandy Tower,Netherlands,IJsselstein,366.80,1203.0,1961
17,Guyed tubular steel mast,TV Tower Vinnytsia,Ukraine,Vinnytsia,354.00,1161.0,1961
18,Bridge,Millau Viaduct,France,Millau,342.00,1122.0,2004
20,Dam,Jinping-I Dam,China,Liangshan,305.00,1001.0,2013
21,Landmark Tower design,Star Tower,United States,Cincinnati,291.00,954.0,1991
22,Elevator test tower,H1 Tower,China,Guangzhou,273.80,898.0,2020
23,Wind turbine,Haliade-X Prototype,Netherlands,Rotterdam,270.00,886.0,2019
24,Solar power tower,Mohammed bin Rashid Al Maktoum Solar Park,United Arab Emirates,Saih Al-Dahal,262.00,860.0,2020
25,Crane,LR 13000[8],Germany,Germany,248.00,814.0,2013
26,Jackup rig,Noble Lloyd Noble[9],Liberia,Liberia,214.00,702.0,2016
27,Cooling tower,Kalisindh Thermal Power Station,India,Jhalawar,198.90,663.0,2012
28,Monument,Gateway Arch,United States,"St. Louis, Missouri",192.00,630.0,1965
29,Aerial tramway support tower,Tower 2 of Ha Long Queen Cable Car[11],Vietnam,Vietnam,189.00,620.0,2016
30,Water tower,Main tower of Kuwait Towers,Kuwait,Kuwait City,187.00,614.0,1979
31,Statue,Statue of Unity,India,"Narmada district, Gujarat",179.10,597.0,2018
32,Masonry tower,Anaconda Smelter Stack,United States,"Anaconda, Montana",178.30,585.0,1919
33,Inclined structure,Olympic Stadium,Canada,Montreal,175.00,574.0,1976
35,Obelisk,San Jacinto Monument,United States,"La Porte, Texas",173.70,570.0,1939
36,Power station building,Niederaussem Power Station,Germany,Bergheim,172.00,564.0,2002
37,Flagpole,Jeddah Flagpole,Saudi Arabia,Jeddah,168.30,561.0,2014
38,Ferris wheel,High Roller,United States,Las Vegas,167.60,550.0,2014
39,Masonry building,Mole Antonelliana,Italy,Torino,167.50,550.0,1889
40,Industrial hall,Vehicle Assembly Building,United States,"Kennedy Space Center, Florida",160.00,525.0,1966
41,Air traffic control tower,Kuala Lumpur International Airport 2 Control T...,Malaysia,Sepang,141.30,463.6,2013[13]
42,Roller coaster,Kingda Ka,United States,"Jackson, New Jersey",138.98,456.0,2005
43,Tomb,Great Pyramid of Giza,Egypt,Giza,138.80,455.2,2560 BCE
44,Drop tower,Zumanjaro: Drop of Doom,United States,"Jackson Township, NJ",139.00,456.0,2014
45,Gantry crane,Kockums Crane,South Korea,Ulsan,135.90,453.0,1974
46,Stupa,Jetavanaramaya,Sri Lanka,Anuradhapura,122.00,400.0,273–301 CE
47,Wooden structure,Gliwice Radio Tower,Poland,Gliwice,118.00,387.0,1935
48,Storage silo,Swissmill Tower,Switzerland,Zurich,118.00,387.0,2016
50,Gasometer,Gasometer Oberhausen,Germany,Oberhausen,117.50,386.0,1929
51,Clock tower,Joseph Chamberlain Memorial Clock Tower,United Kingdom,Birmingham,98.40,328.0,1908
52,Sphere,Avicii Arena,Sweden,Stockholm,85.00,279.0,1989
53,Gopuram,Murudeshwara Temple,India,Murudeshwara,76.00,249.0,2008

Your output above should be as shown in figure below. 

<br>
<img src="Figure 8.png", style="width: 400px";>